app/controllers/api/v1/tasks_controller.rb

            def index
                tasks = Task.all
---
SELECT "tasks".* FROM "tasks"

                task = Task.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]